ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_adc_regs.xml
<module id="ADC_REGS" HW_revision="" description="ADC Registers">
	<register id="ADCCTL1" width="16" page="0" offset="0x0" instances="1" instaddr="2" internal="0" description="ADC Control 1 Register">
		<bitfield id="INTPULSEPOS" description="ADC Interrupt Pulse Position" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADCPWDNZ" description="ADC Power Down" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ADCBSYCHN" description="ADC Busy Channel" begin="12" end="8" width="5" rwaccess="R"/>
		<bitfield id="ADCBSY" description="ADC Busy" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="EXTMUXPRESELECTEN" description="External Mux Preselect Enable" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="TDMAEN" description="Enable Alternate DMA Timings" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCCTL2" width="16" page="0" offset="0x2" instances="1" instaddr="2" internal="0" description="ADC Control 2 Register">
		<bitfield id="PRESCALE" description="ADC Clock Prescaler" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="RESOLUTION" description="SOC Conversion Resolution" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SIGNALMODE" description="SOC Signaling Mode" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="OFFTRIMMODE" description="Offset Trim Mode" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCBURSTCTL" width="16" page="0" offset="0xc" instances="1" instaddr="2" internal="0" description="ADC Burst Control Register">
		<bitfield id="BURSTTRIGSEL" description="SOC Burst Trigger Source Select" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="BURSTSIZE" description="SOC Burst Size Select" begin="12" end="8" width="5" rwaccess="RW"/>
		<bitfield id="BURSTEN" description="SOC Burst Mode Enable" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCINTFLG" width="16" page="0" offset="0xe" instances="1" instaddr="2" internal="0" description="ADC Interrupt Flag Register">
		<bitfield id="ADCINT1" description="ADC Interrupt 1 Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ADCINT2" description="ADC Interrupt 2 Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ADCINT3" description="ADC Interrupt 3 Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="ADCINT4" description="ADC Interrupt 4 Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="ADCINT1RESULT" description="ADC Interrupt 1 Results Ready" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ADCINT2RESULT" description="ADC Interrupt 2 Results Ready" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ADCINT3RESULT" description="ADC Interrupt 3 Results Ready" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="ADCINT4RESULT" description="ADC Interrupt 4 Results Ready" begin="7" end="7" width="1" rwaccess="R"/>
	</register>
	<register id="ADCINTFLGCLR" width="16" page="0" offset="0x10" instances="1" instaddr="2" internal="0" description="ADC Interrupt Flag Clear Register">
		<bitfield id="ADCINT1" description="ADC Interrupt 1 Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADCINT2" description="ADC Interrupt 2 Flag Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADCINT3" description="ADC Interrupt 3 Flag Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADCINT4" description="ADC Interrupt 4 Flag Clear" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCINTOVF" width="16" page="0" offset="0x12" instances="1" instaddr="2" internal="0" description="ADC Interrupt Overflow Register">
		<bitfield id="ADCINT1" description="ADC Interrupt 1 Overflow Flags" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ADCINT2" description="ADC Interrupt 2 Overflow Flags" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ADCINT3" description="ADC Interrupt 3 Overflow Flags" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="ADCINT4" description="ADC Interrupt 4 Overflow Flags" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="ADCINTOVFCLR" width="16" page="0" offset="0x14" instances="1" instaddr="2" internal="0" description="ADC Interrupt Overflow Clear Register">
		<bitfield id="ADCINT1" description="ADC Interrupt 1 Overflow Clear Bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADCINT2" description="ADC Interrupt 2 Overflow Clear Bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADCINT3" description="ADC Interrupt 3 Overflow Clear Bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADCINT4" description="ADC Interrupt 4 Overflow Clear Bits" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCINTSEL1N2" width="16" page="0" offset="0x16" instances="1" instaddr="2" internal="0" description="ADC Interrupt 1 and 2 Selection Register">
		<bitfield id="INT1SEL" description="ADCINT1 EOC Source Select" begin="5" end="0" width="6" rwaccess="RW"/>
		<bitfield id="INT1CONT" description="ADCINT1 Continue to Interrupt Mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INT1E" description="ADCINT1 Interrupt Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INT2SEL" description="ADCINT2 EOC Source Select" begin="13" end="8" width="6" rwaccess="RW"/>
		<bitfield id="INT2CONT" description="ADCINT2 Continue to Interrupt Mode" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INT2E" description="ADCINT2 Interrupt Enable" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCINTSEL3N4" width="16" page="0" offset="0x18" instances="1" instaddr="2" internal="0" description="ADC Interrupt 3 and 4 Selection Register">
		<bitfield id="INT3SEL" description="ADCINT3 EOC Source Select" begin="5" end="0" width="6" rwaccess="RW"/>
		<bitfield id="INT3CONT" description="ADCINT3 Continue to Interrupt Mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INT3E" description="ADCINT3 Interrupt Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="INT4SEL" description="ADCINT4 EOC Source Select" begin="13" end="8" width="6" rwaccess="RW"/>
		<bitfield id="INT4CONT" description="ADCINT4 Continue to Interrupt Mode" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="INT4E" description="ADCINT4 Interrupt Enable" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCSOCPRICTL" width="16" page="0" offset="0x1a" instances="1" instaddr="2" internal="0" description="ADC SOC Priority Control Register">
		<bitfield id="SOCPRIORITY" description="SOC Priority" begin="5" end="0" width="6" rwaccess="RW"/>
		<bitfield id="RRPOINTER" description="Round Robin Pointer" begin="11" end="6" width="6" rwaccess="R"/>
	</register>
	<register id="ADCINTSOCSEL1" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="ADC Interrupt SOC Selection 1 Register">
		<bitfield id="SOC0" description="SOC0 ADC Interrupt Trigger Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="SOC1" description="SOC1 ADC Interrupt Trigger Select" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="SOC2" description="SOC2 ADC Interrupt Trigger Select" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SOC3" description="SOC3 ADC Interrupt Trigger Select" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="SOC4" description="SOC4 ADC Interrupt Trigger Select" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="SOC5" description="SOC5 ADC Interrupt Trigger Select" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="SOC6" description="SOC6 ADC Interrupt Trigger Select" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="SOC7" description="SOC7 ADC Interrupt Trigger Select" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="SOC8" description="SOC8 ADC Interrupt Trigger Select" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="SOC9" description="SOC9 ADC Interrupt Trigger Select" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="SOC10" description="SOC10 ADC Interrupt Trigger Select" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="SOC11" description="SOC11 ADC Interrupt Trigger Select" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="SOC12" description="SOC12 ADC Interrupt Trigger Select" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="SOC13" description="SOC13 ADC Interrupt Trigger Select" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="SOC14" description="SOC14 ADC Interrupt Trigger Select" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="SOC15" description="SOC15 ADC Interrupt Trigger Select" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCINTSOCSEL2" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="ADC Interrupt SOC Selection 2 Register">
		<bitfield id="SOC16" description="SOC16 ADC Interrupt Trigger Select" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="SOC17" description="SOC17 ADC Interrupt Trigger Select" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="SOC18" description="SOC18 ADC Interrupt Trigger Select" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SOC19" description="SOC19 ADC Interrupt Trigger Select" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="SOC20" description="SOC20 ADC Interrupt Trigger Select" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="SOC21" description="SOC21 ADC Interrupt Trigger Select" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="SOC22" description="SOC22 ADC Interrupt Trigger Select" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="SOC23" description="SOC23 ADC Interrupt Trigger Select" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="SOC24" description="SOC24 ADC Interrupt Trigger Select" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="SOC25" description="SOC25 ADC Interrupt Trigger Select" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="SOC26" description="SOC26 ADC Interrupt Trigger Select" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="SOC27" description="SOC27 ADC Interrupt Trigger Select" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="SOC28" description="SOC28 ADC Interrupt Trigger Select" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="SOC29" description="SOC29 ADC Interrupt Trigger Select" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="SOC30" description="SOC30 ADC Interrupt Trigger Select" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="SOC31" description="SOC31 ADC Interrupt Trigger Select" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
