ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_adc_regs.xml
	<register id="ADCSOCOVF1" width="32" page="0" offset="0x2c" instances="1" instaddr="4" internal="0" description="ADC SOC Overflow 1 Register">
		<bitfield id="SOC0" description="SOC0 Start of Conversion Overflow Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SOC1" description="SOC1 Start of Conversion Overflow Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="SOC2" description="SOC2 Start of Conversion Overflow Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SOC3" description="SOC3 Start of Conversion Overflow Flag" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="SOC4" description="SOC4 Start of Conversion Overflow Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="SOC5" description="SOC5 Start of Conversion Overflow Flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="SOC6" description="SOC6 Start of Conversion Overflow Flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="SOC7" description="SOC7 Start of Conversion Overflow Flag" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="SOC8" description="SOC8 Start of Conversion Overflow Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SOC9" description="SOC9 Start of Conversion Overflow Flag" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="SOC10" description="SOC10 Start of Conversion Overflow Flag" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="SOC11" description="SOC11 Start of Conversion Overflow Flag" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="SOC12" description="SOC12 Start of Conversion Overflow Flag" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="SOC13" description="SOC13 Start of Conversion Overflow Flag" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="SOC14" description="SOC14 Start of Conversion Overflow Flag" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="SOC15" description="SOC15 Start of Conversion Overflow Flag" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="SOC16" description="SOC16 Start of Conversion Overflow Flag" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="SOC17" description="SOC17 Start of Conversion Overflow Flag" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="SOC18" description="SOC18 Start of Conversion Overflow Flag" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="SOC19" description="SOC19 Start of Conversion Overflow Flag" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="SOC20" description="SOC20 Start of Conversion Overflow Flag" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="SOC21" description="SOC21 Start of Conversion Overflow Flag" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="SOC22" description="SOC22 Start of Conversion Overflow Flag" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="SOC23" description="SOC23 Start of Conversion Overflow Flag" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="SOC24" description="SOC24 Start of Conversion Overflow Flag" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="SOC25" description="SOC25 Start of Conversion Overflow Flag" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="SOC26" description="SOC26 Start of Conversion Overflow Flag" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="SOC27" description="SOC27 Start of Conversion Overflow Flag" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="SOC28" description="SOC28 Start of Conversion Overflow Flag" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="SOC29" description="SOC29 Start of Conversion Overflow Flag" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="SOC30" description="SOC30 Start of Conversion Overflow Flag" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="SOC31" description="SOC31 Start of Conversion Overflow Flag" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="ADCSOCOVFCLR1" width="32" page="0" offset="0x30" instances="1" instaddr="4" internal="0" description="ADC SOC Overflow Clear 1 Register">
		<bitfield id="SOC0" description="SOC0 Clear Start of Conversion Overflow Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SOC1" description="SOC1 Clear Start of Conversion Overflow Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SOC2" description="SOC2 Clear Start of Conversion Overflow Bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SOC3" description="SOC3 Clear Start of Conversion Overflow Bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SOC4" description="SOC4 Clear Start of Conversion Overflow Bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SOC5" description="SOC5 Clear Start of Conversion Overflow Bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SOC6" description="SOC6 Clear Start of Conversion Overflow Bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SOC7" description="SOC7 Clear Start of Conversion Overflow Bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SOC8" description="SOC8 Clear Start of Conversion Overflow Bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SOC9" description="SOC9 Clear Start of Conversion Overflow Bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SOC10" description="SOC10 Clear Start of Conversion Overflow Bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SOC11" description="SOC11 Clear Start of Conversion Overflow Bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SOC12" description="SOC12 Clear Start of Conversion Overflow Bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SOC13" description="SOC13 Clear Start of Conversion Overflow Bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SOC14" description="SOC14 Clear Start of Conversion Overflow Bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SOC15" description="SOC15 Clear Start of Conversion Overflow Bit" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="SOC16" description="SOC16 Clear Start of Conversion Overflow Bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="SOC17" description="SOC17 Clear Start of Conversion Overflow Bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="SOC18" description="SOC18 Clear Start of Conversion Overflow Bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="SOC19" description="SOC19 Clear Start of Conversion Overflow Bit" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="SOC20" description="SOC20 Clear Start of Conversion Overflow Bit" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="SOC21" description="SOC21 Clear Start of Conversion Overflow Bit" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="SOC22" description="SOC22 Clear Start of Conversion Overflow Bit" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="SOC23" description="SOC23 Clear Start of Conversion Overflow Bit" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="SOC24" description="SOC24 Clear Start of Conversion Overflow Bit" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="SOC25" description="SOC25 Clear Start of Conversion Overflow Bit" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="SOC26" description="SOC26 Clear Start of Conversion Overflow Bit" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="SOC27" description="SOC27 Clear Start of Conversion Overflow Bit" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="SOC28" description="SOC28 Clear Start of Conversion Overflow Bit" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="SOC29" description="SOC29 Clear Start of Conversion Overflow Bit" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="SOC30" description="SOC30 Clear Start of Conversion Overflow Bit" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="SOC31" description="SOC31 Clear Start of Conversion Overflow Bit" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCSOC0CTL" width="32" page="0" offset="0x34" instances="1" instaddr="4" internal="0" description="ADC SOC0 Control Register">
		<bitfield id="ACQPS" description="SOC0 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC0 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC0 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC0 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC1CTL" width="32" page="0" offset="0x38" instances="1" instaddr="4" internal="0" description="ADC SOC1 Control Register">
		<bitfield id="ACQPS" description="SOC1 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC1 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC1 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC1 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC2CTL" width="32" page="0" offset="0x3c" instances="1" instaddr="4" internal="0" description="ADC SOC2 Control Register">
		<bitfield id="ACQPS" description="SOC2 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC2 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC2 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC2 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC3CTL" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="ADC SOC3 Control Register">
		<bitfield id="ACQPS" description="SOC3 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC3 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC3 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC3 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
