ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_adc_regs.xml
	<register id="ADCSOC4CTL" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="ADC SOC4 Control Register">
		<bitfield id="ACQPS" description="SOC4 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC4 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC4 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC4 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC5CTL" width="32" page="0" offset="0x48" instances="1" instaddr="4" internal="0" description="ADC SOC5 Control Register">
		<bitfield id="ACQPS" description="SOC5 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC5 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC5 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC5 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC6CTL" width="32" page="0" offset="0x4c" instances="1" instaddr="4" internal="0" description="ADC SOC6 Control Register">
		<bitfield id="ACQPS" description="SOC6 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC6 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC6 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC6 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC7CTL" width="32" page="0" offset="0x50" instances="1" instaddr="4" internal="0" description="ADC SOC7 Control Register">
		<bitfield id="ACQPS" description="SOC7 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC7 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC7 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC7 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC8CTL" width="32" page="0" offset="0x54" instances="1" instaddr="4" internal="0" description="ADC SOC8 Control Register">
		<bitfield id="ACQPS" description="SOC8 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC8 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC8 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC8 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC9CTL" width="32" page="0" offset="0x58" instances="1" instaddr="4" internal="0" description="ADC SOC9 Control Register">
		<bitfield id="ACQPS" description="SOC9 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC9 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC9 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC9 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC10CTL" width="32" page="0" offset="0x5c" instances="1" instaddr="4" internal="0" description="ADC SOC10 Control Register">
		<bitfield id="ACQPS" description="SOC10 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC10 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC10 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC10 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC11CTL" width="32" page="0" offset="0x60" instances="1" instaddr="4" internal="0" description="ADC SOC11 Control Register">
		<bitfield id="ACQPS" description="SOC11 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC11 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC11 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC11 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC12CTL" width="32" page="0" offset="0x64" instances="1" instaddr="4" internal="0" description="ADC SOC12 Control Register">
		<bitfield id="ACQPS" description="SOC12 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC12 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC12 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC12 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC13CTL" width="32" page="0" offset="0x68" instances="1" instaddr="4" internal="0" description="ADC SOC13 Control Register">
		<bitfield id="ACQPS" description="SOC13 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC13 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC13 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC13 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC14CTL" width="32" page="0" offset="0x6c" instances="1" instaddr="4" internal="0" description="ADC SOC14 Control Register">
		<bitfield id="ACQPS" description="SOC14 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC14 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC14 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC14 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC15CTL" width="32" page="0" offset="0x70" instances="1" instaddr="4" internal="0" description="ADC SOC15 Control Register">
		<bitfield id="ACQPS" description="SOC15 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC15 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC15 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC15 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
