ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_adc_regs.xml
	<register id="ADCSOC16CTL" width="32" page="0" offset="0x74" instances="1" instaddr="4" internal="0" description="ADC SOC16 Control Register">
		<bitfield id="ACQPS" description="SOC16 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC16 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC16 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC16 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC17CTL" width="32" page="0" offset="0x78" instances="1" instaddr="4" internal="0" description="ADC SOC17 Control Register">
		<bitfield id="ACQPS" description="SOC17 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC17 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC17 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC17 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC18CTL" width="32" page="0" offset="0x7c" instances="1" instaddr="4" internal="0" description="ADC SOC18 Control Register">
		<bitfield id="ACQPS" description="SOC18 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC18 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC18 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC18 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC19CTL" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="ADC SOC19 Control Register">
		<bitfield id="ACQPS" description="SOC19 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC19 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC19 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC19 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC20CTL" width="32" page="0" offset="0x84" instances="1" instaddr="4" internal="0" description="ADC SOC20 Control Register">
		<bitfield id="ACQPS" description="SOC20 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC20 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC20 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC20 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC21CTL" width="32" page="0" offset="0x88" instances="1" instaddr="4" internal="0" description="ADC SOC21 Control Register">
		<bitfield id="ACQPS" description="SOC21 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC21 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC21 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC21 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC22CTL" width="32" page="0" offset="0x8c" instances="1" instaddr="4" internal="0" description="ADC SOC22 Control Register">
		<bitfield id="ACQPS" description="SOC22 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC22 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC22 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC22 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC23CTL" width="32" page="0" offset="0x90" instances="1" instaddr="4" internal="0" description="ADC SOC23 Control Register">
		<bitfield id="ACQPS" description="SOC23 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC23 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC23 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC23 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC24CTL" width="32" page="0" offset="0x94" instances="1" instaddr="4" internal="0" description="ADC SOC24 Control Register">
		<bitfield id="ACQPS" description="SOC24 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC24 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC24 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC24 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC25CTL" width="32" page="0" offset="0x98" instances="1" instaddr="4" internal="0" description="ADC SOC25 Control Register">
		<bitfield id="ACQPS" description="SOC25 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC25 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC25 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC25 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC26CTL" width="32" page="0" offset="0x9c" instances="1" instaddr="4" internal="0" description="ADC SOC26 Control Register">
		<bitfield id="ACQPS" description="SOC26 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC26 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC26 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC26 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC27CTL" width="32" page="0" offset="0xa0" instances="1" instaddr="4" internal="0" description="ADC SOC27 Control Register">
		<bitfield id="ACQPS" description="SOC27 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC27 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC27 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC27 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC28CTL" width="32" page="0" offset="0xa4" instances="1" instaddr="4" internal="0" description="ADC SOC28 Control Register">
		<bitfield id="ACQPS" description="SOC28 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC28 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC28 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC28 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC29CTL" width="32" page="0" offset="0xa8" instances="1" instaddr="4" internal="0" description="ADC SOC29 Control Register">
		<bitfield id="ACQPS" description="SOC29 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC29 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC29 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC29 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC30CTL" width="32" page="0" offset="0xac" instances="1" instaddr="4" internal="0" description="ADC SOC30 Control Register">
		<bitfield id="ACQPS" description="SOC30 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC30 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC30 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC30 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCSOC31CTL" width="32" page="0" offset="0xb0" instances="1" instaddr="4" internal="0" description="ADC SOC31 Control Register">
		<bitfield id="ACQPS" description="SOC31 Acquisition Prescale" begin="8" end="0" width="9" rwaccess="RW"/>
		<bitfield id="CHSEL" description="SOC31 Channel Select" begin="19" end="15" width="5" rwaccess="RW"/>
		<bitfield id="TRIGSEL" description="SOC31 Trigger Source Select" begin="26" end="20" width="7" rwaccess="RW"/>
		<bitfield id="EXTCHSEL" description="SOC31 External Channel Mux Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="ADCEVTSTAT" width="16" page="0" offset="0xb4" instances="1" instaddr="2" internal="0" description="ADC Event Status Register">
		<bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Flag" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Flag" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Flag" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Flag" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Flag" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Flag" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Flag" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Flag" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Flag" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Flag" begin="14" end="14" width="1" rwaccess="R"/>
	</register>
	<register id="ADCEVTCLR" width="16" page="0" offset="0xb8" instances="1" instaddr="2" internal="0" description="ADC Event Clear Register">
		<bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Clear" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Clear" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Clear" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Clear" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Clear" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCEVTSEL" width="16" page="0" offset="0xbc" instances="1" instaddr="2" internal="0" description="ADC Event Selection Register">
		<bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Event Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Event Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Event Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Event Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Event Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Event Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Event Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Event Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Event Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Event Enable" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Event Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Event Enable" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCEVTINTSEL" width="16" page="0" offset="0xc0" instances="1" instaddr="2" internal="0" description="ADC Event Interrupt Selection Register">
		<bitfield id="PPB1TRIPHI" description="Post Processing Block 1 Trip High Interrupt Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PPB1TRIPLO" description="Post Processing Block 1 Trip Low Interrupt Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PPB1ZERO" description="Post Processing Block 1 Zero Crossing Interrupt Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPHI" description="Post Processing Block 2 Trip High Interrupt Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PPB2TRIPLO" description="Post Processing Block 2 Trip Low Interrupt Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PPB2ZERO" description="Post Processing Block 2 Zero Crossing Interrupt Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPHI" description="Post Processing Block 3 Trip High Interrupt Enable" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="PPB3TRIPLO" description="Post Processing Block 3 Trip Low Interrupt Enable" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PPB3ZERO" description="Post Processing Block 3 Zero Crossing Interrupt Enable" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPHI" description="Post Processing Block 4 Trip High Interrupt Enable" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PPB4TRIPLO" description="Post Processing Block 4 Trip Low Interrupt Enable" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PPB4ZERO" description="Post Processing Block 4 Zero Crossing Interrupt Enable" begin="14" end="14" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCOSDETECT" width="16" page="0" offset="0xc4" instances="1" instaddr="2" internal="0" description="ADC Open and Shorts Detect Register">
		<bitfield id="DETECTCFG" description="ADC Opens and Shorts Detect Configuration" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="ADCCOUNTER" width="16" page="0" offset="0xc6" instances="1" instaddr="2" internal="0" description="ADC Counter Register">
		<bitfield id="FREECOUNT" description="ADC Free Running Counter Value" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="ADCREV" width="16" page="0" offset="0xc8" instances="1" instaddr="2" internal="0" description="ADC Revision Register">
		<bitfield id="TYPE" description="ADC Type" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="REV" description="ADC Revision" begin="15" end="8" width="8" rwaccess="R"/>
	</register>
	<register id="ADCOFFTRIM" width="16" page="0" offset="0xca" instances="1" instaddr="2" internal="0" description="ADC Offset Trim Register 1">
		<bitfield id="OFFTRIM" description="ADC Offset Trim 12B SE Even" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="OFFTRIM12BSEODD" description="ADC Offset Trim 12B SE Odd" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
