ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_adc_regs.xml
	<register id="ADCOFFTRIM2" width="16" page="0" offset="0xcc" instances="1" instaddr="2" internal="0" description="ADC Offset Trim Register 2">
		<bitfield id="OFFTRIM16BSEEVEN" description="ADC Offset Trim 16B SE Even" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="OFFTRIM16BSEODD" description="ADC Offset Trim 16B SE Odd" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="ADCOFFTRIM3" width="16" page="0" offset="0xce" instances="1" instaddr="2" internal="0" description="ADC Offset Trim Register 3">
		<bitfield id="OFFTRIM12BDE" description="ADC Offset Trim 12B DE" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="OFFTRIM16BDE" description="ADC Offset Trim 16B DE" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="ADCPPB1CONFIG" width="16" page="0" offset="0xd4" instances="1" instaddr="2" internal="0" description="ADC PPB{#} Config Register">
		<bitfield id="CONFIG" description="ADC Post Processing Block 1 Configuration" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="CBCEN" description="Cycle By Cycle Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ABSEN" description="ADC Post Processing Block 1 Absolute Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TWOSCOMPEN" description="ADC Post Processing Block 1 Two's Complement Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="DELTAEN" description="ADC Post Processing Block 1 Last Sample Delta Enable" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCPPB1STAMP" width="16" page="0" offset="0xd6" instances="1" instaddr="2" internal="0" description="ADC PPB1 Sample Delay Time Stamp Register">
		<bitfield id="DLYSTAMP" description="ADC Post Processing Block 1 Delay Time Stamp" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB1OFFCAL" width="16" page="0" offset="0xd8" instances="1" instaddr="2" internal="0" description="ADC PPB1 Offset Calibration Register">
		<bitfield id="OFFCAL" description="ADC Post Processing Block Offset Correction" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="ADCPPB1OFFREF" width="16" page="0" offset="0xda" instances="1" instaddr="2" internal="0" description="ADC PPB1 Offset Reference Register">
		<bitfield id="OFFREF" description="ADC Post Processing Block 1 Offset Reference" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ADCPPB1TRIPHI" width="32" page="0" offset="0xdc" instances="1" instaddr="4" internal="0" description="ADC PPB1 Trip High Register">
		<bitfield id="LIMITHI" description="ADC Post Processing Block 1 Trip High Limit" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="ADCPPB1TRIPLO" width="32" page="0" offset="0xe0" instances="1" instaddr="4" internal="0" description="ADC PPB1 Trip Low/Trigger Time Stamp Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block 1 Trip Low Limit" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="LSIGN" description="Low Limit Sign Bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="LIMITLO2EN" description="Extended Low Limit 2 Enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="REQSTAMP" description="ADC Post Processing Block 1 Request Time Stamp" begin="31" end="20" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPBTRIP1FILCTL" width="16" page="0" offset="0xe4" instances="1" instaddr="2" internal="0" description="ADCEVT1 Trip High Filter Control Register">
		<bitfield id="FILTHIEN" description="ADCPPB1 TRIPHI Filter Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FILTLOEN" description="ADCPPB1 TRIPLO Filter Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="3" width="6" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="14" end="9" width="6" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCPPBTRIP1FILCLKCTL" width="32" page="0" offset="0xe8" instances="1" instaddr="4" internal="0" description="ADCEVT1 Trip High Filter Prescale Control Register">
		<bitfield id="CLKPRESCALE" description="Filter Clock Prescale" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ADCPPB2CONFIG" width="16" page="0" offset="0xf4" instances="1" instaddr="2" internal="0" description="ADC PPB{#} Config Register">
		<bitfield id="CONFIG" description="ADC Post Processing Block 2 Configuration" begin="4" end="0" width="5" rwaccess="RW"/>
		<bitfield id="CBCEN" description="Cycle By Cycle Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ABSEN" description="ADC Post Processing Block 2 Absolute Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TWOSCOMPEN" description="ADC Post Processing Block 2 Two's Complement Enable" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="DELTAEN" description="ADC Post Processing Block 2 Last Sample Delta Enable" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCPPB2STAMP" width="16" page="0" offset="0xf6" instances="1" instaddr="2" internal="0" description="ADC PPB2 Sample Delay Time Stamp Register">
		<bitfield id="DLYSTAMP" description="ADC Post Processing Block 2 Delay Time Stamp" begin="11" end="0" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPB2OFFCAL" width="16" page="0" offset="0xf8" instances="1" instaddr="2" internal="0" description="ADC PPB2 Offset Calibration Register">
		<bitfield id="OFFCAL" description="ADC Post Processing Block Offset Correction" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="ADCPPB2OFFREF" width="16" page="0" offset="0xfa" instances="1" instaddr="2" internal="0" description="ADC PPB2 Offset Reference Register">
		<bitfield id="OFFREF" description="ADC Post Processing Block 2 Offset Reference" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
