ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_adc_regs.xml
	<register id="ADCPPB4TRIPHI" width="32" page="0" offset="0x13c" instances="1" instaddr="4" internal="0" description="ADC PPB4 Trip High Register">
		<bitfield id="LIMITHI" description="ADC Post Processing Block 4 Trip High Limit" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="ADCPPB4TRIPLO" width="32" page="0" offset="0x140" instances="1" instaddr="4" internal="0" description="ADC PPB4 Trip Low/Trigger Time Stamp Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block 4 Trip Low Limit" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="LSIGN" description="Low Limit Sign Bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="LIMITLO2EN" description="Extended Low Limit 2 Enable" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="REQSTAMP" description="ADC Post Processing Block 4 Request Time Stamp" begin="31" end="20" width="12" rwaccess="R"/>
	</register>
	<register id="ADCPPBTRIP4FILCTL" width="16" page="0" offset="0x144" instances="1" instaddr="2" internal="0" description="ADCEVT4 Trip High Filter Control Register">
		<bitfield id="FILTHIEN" description="ADCPPB4 TRIPHI Filter Enable" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FILTLOEN" description="ADCPPB4 TRIPLO Filter Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SAMPWIN" description="Sample Window" begin="8" end="3" width="6" rwaccess="RW"/>
		<bitfield id="THRESH" description="Majority Voting Threshold" begin="14" end="9" width="6" rwaccess="RW"/>
		<bitfield id="FILINIT" description="Filter Initialization Bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCPPBTRIP4FILCLKCTL" width="32" page="0" offset="0x148" instances="1" instaddr="4" internal="0" description="ADCEVT4 Trip High Filter Prescale Control Register">
		<bitfield id="CLKPRESCALE" description="Filter Clock Prescale" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ADCSAFECHECKRESEN" width="32" page="0" offset="0x154" instances="1" instaddr="4" internal="0" description="ADC Safe Check Result Enable Register">
		<bitfield id="SOC0CHKEN" description="ADC SOC0 Safety Checker Result Enable" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="SOC1CHKEN" description="ADC SOC1 Safety Checker Result Enable" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="SOC2CHKEN" description="ADC SOC2 Safety Checker Result Enable" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SOC3CHKEN" description="ADC SOC3 Safety Checker Result Enable" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="SOC4CHKEN" description="ADC SOC4 Safety Checker Result Enable" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="SOC5CHKEN" description="ADC SOC5 Safety Checker Result Enable" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="SOC6CHKEN" description="ADC SOC6 Safety Checker Result Enable" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="SOC7CHKEN" description="ADC SOC7 Safety Checker Result Enable" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="SOC8CHKEN" description="ADC SOC8 Safety Checker Result Enable" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="SOC9CHKEN" description="ADC SOC9 Safety Checker Result Enable" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="SOC10CHKEN" description="ADC SOC10 Safety Checker Result Enable" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="SOC11CHKEN" description="ADC SOC11 Safety Checker Result Enable" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="SOC12CHKEN" description="ADC SOC12 Safety Checker Result Enable" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="SOC13CHKEN" description="ADC SOC13 Safety Checker Result Enable" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="SOC14CHKEN" description="ADC SOC14 Safety Checker Result Enable" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="SOC15CHKEN" description="ADC SOC15 Safety Checker Result Enable" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCSAFECHECKRESEN2" width="32" page="0" offset="0x158" instances="1" instaddr="4" internal="0" description="ADC Safe Check Result Enable 2 Register">
		<bitfield id="SOC16CHKEN" description="ADC SOC16 Safety Checker Result Enable" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="SOC17CHKEN" description="ADC SOC17 Safety Checker Result Enable" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="SOC18CHKEN" description="ADC SOC18 Safety Checker Result Enable" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SOC19CHKEN" description="ADC SOC19 Safety Checker Result Enable" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="SOC20CHKEN" description="ADC SOC20 Safety Checker Result Enable" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="SOC21CHKEN" description="ADC SOC21 Safety Checker Result Enable" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="SOC22CHKEN" description="ADC SOC22 Safety Checker Result Enable" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="SOC23CHKEN" description="ADC SOC23 Safety Checker Result Enable" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="SOC24CHKEN" description="ADC SOC24 Safety Checker Result Enable" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="SOC25CHKEN" description="ADC SOC25 Safety Checker Result Enable" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="SOC26CHKEN" description="ADC SOC26 Safety Checker Result Enable" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="SOC27CHKEN" description="ADC SOC27 Safety Checker Result Enable" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="SOC28CHKEN" description="ADC SOC28 Safety Checker Result Enable" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="SOC29CHKEN" description="ADC SOC29 Safety Checker Result Enable" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="SOC30CHKEN" description="ADC SOC30 Safety Checker Result Enable" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="SOC31CHKEN" description="ADC SOC31 Safety Checker Result Enable" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
