ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_adc_regs.xml
	<register id="ADCINTCYCLE" width="16" page="0" offset="0x172" instances="1" instaddr="2" internal="0" description="ADC Early Interrupt Generation Cycle">
		<bitfield id="DELAY" description="Delay from ADCSOC fall edge to early interrupt generation." begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM1" width="32" page="0" offset="0x174" instances="1" instaddr="4" internal="0" description="ADC Linearity Trim 1 Register">
		<bitfield id="INLTRIM31TO0" description="ADC Linearity Trim Bits 31-0" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM2" width="32" page="0" offset="0x178" instances="1" instaddr="4" internal="0" description="ADC Linearity Trim 2 Register">
		<bitfield id="INLTRIM63TO32" description="ADC Linearity Trim Bits 63-32" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM3" width="32" page="0" offset="0x17c" instances="1" instaddr="4" internal="0" description="ADC Linearity Trim 3 Register">
		<bitfield id="INLTRIM95TO64" description="ADC Linearity Trim Bits 95-64" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM4" width="32" page="0" offset="0x180" instances="1" instaddr="4" internal="0" description="ADC Linearity Trim 4 Register">
		<bitfield id="INLTRIM127TO96" description="ADC Linearity Trim Bits 127-96" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM5" width="32" page="0" offset="0x184" instances="1" instaddr="4" internal="0" description="ADC Linearity Trim 5 Register">
		<bitfield id="INLTRIM159TO128" description="ADC Linearity Trim Bits 159-128" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCINLTRIM6" width="32" page="0" offset="0x188" instances="1" instaddr="4" internal="0" description="ADC Linearity Trim 6 Register">
		<bitfield id="INLTRIM191TO160" description="ADC Linearity Trim Bits 191-160" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="ADCREV2" width="16" page="0" offset="0x18e" instances="1" instaddr="2" internal="0" description="ADC Wrapper Revision Register">
		<bitfield id="WRAPPERTYPE" description="ADC Wrapper Type" begin="7" end="0" width="8" rwaccess="R"/>
		<bitfield id="WRAPPERREV" description="ADC Wrapper Revision" begin="15" end="8" width="8" rwaccess="R"/>
	</register>
	<register id="REP1CTL" width="32" page="0" offset="0x194" instances="1" instaddr="4" internal="0" description="ADC Trigger Repeater 1 Control Register">
		<bitfield id="MODE" description="ADC Trigger Repeater 1 Mode Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACTIVEMODE" description="ADC Trigger Repeater 1 Active Mode" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="MODULEBUSY" description="ADC Trigger Repeater 1 Module Busy" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="PHASEOVF" description="ADC Trigger Repeater 1 Phase Delay Overflow" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIGGEROVF" description="ADC Trigger Repeater 1 Oversampled Trigger Overflow" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIGGER" description="ADC Trigger Repeater 1 Trigger Select" begin="14" end="8" width="7" rwaccess="RW"/>
		<bitfield id="SYNCINSEL" description="ADC Trigger Repeater 1 Sync. In Select" begin="21" end="16" width="6" rwaccess="RW"/>
		<bitfield id="SWSYNC" description="ADC Trigger Repeater 1 Software Sync." begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="REP1N" width="32" page="0" offset="0x198" instances="1" instaddr="4" internal="0" description="ADC Trigger Repeater 1 N Select Register">
		<bitfield id="NSEL" description="ADC Trigger Repeater 1 Trigger Number Selection" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="NCOUNT" description="ADC Trigger Repeater 1 Trigger Counter" begin="22" end="16" width="7" rwaccess="R"/>
	</register>
	<register id="REP1PHASE" width="32" page="0" offset="0x19c" instances="1" instaddr="4" internal="0" description="ADC Trigger Repeater 1 Phase Select Register">
		<bitfield id="PHASE" description="ADC Trigger Repeater 1 Phase Delay Configuration" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="PHASECOUNT" description="ADC Trigger Repeater 1 Phase Delay Status" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="REP1SPREAD" width="32" page="0" offset="0x1a0" instances="1" instaddr="4" internal="0" description="ADC Trigger Repeater 1 Spread Select Register">
		<bitfield id="SPREAD" description="ADC Trigger Repeater 1 Spread Delay Configuration" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="SPREADCOUNT" description="ADC Trigger Repeater 1 Spread Delay Status" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="REP1FRC" width="16" page="0" offset="0x1a4" instances="1" instaddr="2" internal="0" description="ADC Trigger Repeater 1 Software Force Register">
		<bitfield id="SWFRC" description="ADC Trigger Repeater 1 Software Force" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="REP2CTL" width="32" page="0" offset="0x1b4" instances="1" instaddr="4" internal="0" description="ADC Trigger Repeater 2 Control Register">
		<bitfield id="MODE" description="ADC Trigger Repeater 2 Mode Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACTIVEMODE" description="ADC Trigger Repeater 2 Active Mode" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="MODULEBUSY" description="ADC Trigger Repeater 2 Module Busy" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="PHASEOVF" description="ADC Trigger Repeater 2 Phase Delay Overflow" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="TRIGGEROVF" description="ADC Trigger Repeater 2 Oversampled Trigger Overflow" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="TRIGGER" description="ADC Trigger Repeater 2 Trigger Select" begin="14" end="8" width="7" rwaccess="RW"/>
		<bitfield id="SYNCINSEL" description="ADC Trigger Repeater 2 Sync. In Select" begin="21" end="16" width="6" rwaccess="RW"/>
		<bitfield id="SWSYNC" description="ADC Trigger Repeater 2 Software Sync." begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
	<register id="REP2N" width="32" page="0" offset="0x1b8" instances="1" instaddr="4" internal="0" description="ADC Trigger Repeater 2 N Select Register">
		<bitfield id="NSEL" description="ADC Trigger Repeater 2 Trigger Number Selection" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="NCOUNT" description="ADC Trigger Repeater 2 Trigger Counter" begin="22" end="16" width="7" rwaccess="R"/>
	</register>
	<register id="REP2PHASE" width="32" page="0" offset="0x1bc" instances="1" instaddr="4" internal="0" description="ADC Trigger Repeater 2 Phase Select Register">
		<bitfield id="PHASE" description="ADC Trigger Repeater 2 Phase Delay Configuration" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="PHASECOUNT" description="ADC Trigger Repeater 2 Phase Delay Status" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="REP2SPREAD" width="32" page="0" offset="0x1c0" instances="1" instaddr="4" internal="0" description="ADC Trigger Repeater 2 Spread Select Register">
		<bitfield id="SPREAD" description="ADC Trigger Repeater 2 Spread Delay Configuration" begin="15" end="0" width="16" rwaccess="RW"/>
		<bitfield id="SPREADCOUNT" description="ADC Trigger Repeater 2 Spread Delay Status" begin="31" end="16" width="16" rwaccess="R"/>
	</register>
	<register id="REP2FRC" width="16" page="0" offset="0x1c4" instances="1" instaddr="2" internal="0" description="ADC Trigger Repeater 2 Software Force Register">
		<bitfield id="SWFRC" description="ADC Trigger Repeater 2 Software Force" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCPPB1LIMIT" width="16" page="0" offset="0x1d4" instances="1" instaddr="2" internal="0" description="ADC PPB1Conversion Count Limit Register">
		<bitfield id="LIMIT" description="Post Processing Block 1 Limit" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="ADCPPBP1PCOUNT" width="16" page="0" offset="0x1d8" instances="1" instaddr="2" internal="0" description="ADC PPB1 Partial Conversion Count Register">
		<bitfield id="PCOUNT" description="Post Processing Block 1 Partial Count" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
