ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_adc_regs.xml
	<register id="ADCPPB2TRIPLO2" width="32" page="0" offset="0x228" instances="1" instaddr="4" internal="0" description="ADC PPB2 Extended Trip Low Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block 2 Trip Low Limit" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="ADCPPB3LIMIT" width="16" page="0" offset="0x23c" instances="1" instaddr="2" internal="0" description="ADC PPB3Conversion Count Limit Register">
		<bitfield id="LIMIT" description="Post Processing Block 3 Limit" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="ADCPPBP3PCOUNT" width="16" page="0" offset="0x240" instances="1" instaddr="2" internal="0" description="ADC PPB3 Partial Conversion Count Register">
		<bitfield id="PCOUNT" description="Post Processing Block 3 Partial Count" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB3CONFIG2" width="16" page="0" offset="0x244" instances="1" instaddr="2" internal="0" description="ADC PPB3 Sum Shift Register">
		<bitfield id="SHIFT" description="Post Processing Block 3 Right Shift" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="SYNCINSEL" description="Post Processing Block 3 Sync. Input Select" begin="9" end="4" width="6" rwaccess="RW"/>
		<bitfield id="SWSYNC" description="Post Processing Block 3 Software Force Sync. " begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="OSINTSEL" description="Post Processing Block 3 Interrupt Source Select" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="COMPSEL" description="Post Processing Block 3 Compare Source Select" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCPPB3PSUM" width="32" page="0" offset="0x248" instances="1" instaddr="4" internal="0" description="ADC PPB3 Partial Sum Register">
		<bitfield id="PSUM" description="Post Processing Block 3 Oversampling Partial Sum" begin="23" end="0" width="24" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="ADCPPB3PMAX" width="32" page="0" offset="0x24c" instances="1" instaddr="4" internal="0" description="ADC PPB3 Partial Max Register">
		<bitfield id="PMAX" description="Post Processing Block 3 Oversampling Partial Max" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB3PMAXI" width="16" page="0" offset="0x250" instances="1" instaddr="2" internal="0" description="ADC PPB3 Partial Max Index Register">
		<bitfield id="PMAXI" description="Post Processing Block 3 Oversampling Partial Index of Max" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB3PMIN" width="32" page="0" offset="0x254" instances="1" instaddr="4" internal="0" description="ADC PPB3 Partial MIN Register">
		<bitfield id="PMIN" description="Post Processing Block 3 Oversampling Partial Min" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB3PMINI" width="16" page="0" offset="0x258" instances="1" instaddr="2" internal="0" description="ADC PPB3 Partial Min Index Register">
		<bitfield id="PMINI" description="Post Processing Block 3 Oversampling Partial Index of Min" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB3TRIPLO2" width="32" page="0" offset="0x25c" instances="1" instaddr="4" internal="0" description="ADC PPB3 Extended Trip Low Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block 3 Trip Low Limit" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="ADCPPB4LIMIT" width="16" page="0" offset="0x270" instances="1" instaddr="2" internal="0" description="ADC PPB4Conversion Count Limit Register">
		<bitfield id="LIMIT" description="Post Processing Block 4 Limit" begin="9" end="0" width="10" rwaccess="RW"/>
	</register>
	<register id="ADCPPBP4PCOUNT" width="16" page="0" offset="0x274" instances="1" instaddr="2" internal="0" description="ADC PPB4 Partial Conversion Count Register">
		<bitfield id="PCOUNT" description="Post Processing Block 4 Partial Count" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB4CONFIG2" width="16" page="0" offset="0x278" instances="1" instaddr="2" internal="0" description="ADC PPB4 Sum Shift Register">
		<bitfield id="SHIFT" description="Post Processing Block 4 Right Shift" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="SYNCINSEL" description="Post Processing Block 4 Sync. Input Select" begin="9" end="4" width="6" rwaccess="RW"/>
		<bitfield id="SWSYNC" description="Post Processing Block 4 Software Force Sync. " begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="OSINTSEL" description="Post Processing Block 4 Interrupt Source Select" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="COMPSEL" description="Post Processing Block 4 Compare Source Select" begin="15" end="14" width="2" rwaccess="RW"/>
	</register>
	<register id="ADCPPB4PSUM" width="32" page="0" offset="0x27c" instances="1" instaddr="4" internal="0" description="ADC PPB4 Partial Sum Register">
		<bitfield id="PSUM" description="Post Processing Block 4 Oversampling Partial Sum" begin="23" end="0" width="24" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="ADCPPB4PMAX" width="32" page="0" offset="0x280" instances="1" instaddr="4" internal="0" description="ADC PPB4 Partial Max Register">
		<bitfield id="PMAX" description="Post Processing Block 4 Oversampling Partial Max" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB4PMAXI" width="16" page="0" offset="0x284" instances="1" instaddr="2" internal="0" description="ADC PPB4 Partial Max Index Register">
		<bitfield id="PMAXI" description="Post Processing Block 4 Oversampling Partial Index of Max" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB4PMIN" width="32" page="0" offset="0x288" instances="1" instaddr="4" internal="0" description="ADC PPB4 Partial MIN Register">
		<bitfield id="PMIN" description="Post Processing Block 4 Oversampling Partial Min" begin="16" end="0" width="17" rwaccess="R"/>
		<bitfield id="SIGN" description="Sign Extended Bits" begin="31" end="17" width="15" rwaccess="R"/>
	</register>
	<register id="ADCPPB4PMINI" width="16" page="0" offset="0x28c" instances="1" instaddr="2" internal="0" description="ADC PPB4 Partial Min Index Register">
		<bitfield id="PMINI" description="Post Processing Block 4 Oversampling Partial Index of Min" begin="9" end="0" width="10" rwaccess="R"/>
	</register>
	<register id="ADCPPB4TRIPLO2" width="32" page="0" offset="0x290" instances="1" instaddr="4" internal="0" description="ADC PPB4 Extended Trip Low Register">
		<bitfield id="LIMITLO" description="ADC Post Processing Block 4 Trip Low Limit" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
</module>
